module.exports = {
  getMockRecCard() {
    return {
      title: ['今日主题：灯火'],
      date: '2024/05/26',
      url: 'https://pic-artastic.oss-cn-shanghai.aliyuncs.com/Rectangle%202.png',
    }
  },
  getMockPosts() {
    return [
      {
        "id": "1",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 10,
        "mode": "私",
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "2",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 11,
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "3",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 12,
        "mode": "私",
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "4",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 13,
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "5",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 13,
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "6",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 13,
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "7",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 13,
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      },
      {
        "id": "8",
        "title": "飞花令：春",
        "cover": "https://img.cjyun.org.cn/a/10008/201805/90a8a8e76ab9de005e34f0778367ae22.jpeg",
        "repliesCount": 13,
        "poetry": "想眼中能有多少泪珠儿， \n怎禁得秋流到冬尽， \n春流到夏!",
        "lastModified": "5天前",
        "author": "曹雪芹《红楼梦十二曲·其三·枉凝眉》",
        "desc": "这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。这是飞花令的规则。"
      }
    ]
  }
}
